USE country_db;
TRUNCATE TABLE Countries;

-- Вставка тестовых данных
INSERT INTO Countries (shortName, fullName, isoAlpha2, isoAlpha3, isoNumeric, population, square) VALUES
('Россия', 'Российская Федерация', 'RU', 'RUS', 643, 146150789, 17125191.0),
('США', 'Соединенные Штаты Америки', 'US', 'USA', 840, 331002651, 9833520.0),
('Китай', 'Китайская Народная Республика', 'CN', 'CHN', 156, 1444216000, 9596960.0),
('Индия', 'Республика Индия', 'IN', 'IND', 356, 1380004385, 3287590.0),
('Бразилия', 'Федеративная Республика Бразилия', 'BR', 'BRA', 76, 212559417, 8515767.0),
('Канада', 'Канада', 'CA', 'CAN', 124, 38008000, 9984670.0),
('Австралия', 'Австралийский Союз', 'AU', 'AUS', 36, 25499853, 7692024.0),
('Индонезия', 'Республика Индонезия', 'ID', 'IDN', 360, 273523615, 1904569.0),
('Пакистан', 'Исламская Республика Пакистан', 'PK', 'PAK', 586, 220892340, 796095.0),
('Нигерия', 'Федеративная Республика Нигерия', 'NG', 'NGA', 566, 206139589, 923768.0);s